<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class SalesOfficeTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {

        $States = [
            [
                'id' => 1,
                'name' => 'Ardabil',
                'FA' => 'اردبيل',
                'EN' => 'Ardabil',
                'RU' => 'Ардебиль',
                'AR' => 'أردبيل',

            ],
            [
                'id' => 2,
                'name' => 'Esfahan',
                'FA' => 'اصفهان
فلکه دانشگاه،خیابان امام خمینی،بعد از شاپورجدید، خیابان شهید زرین، جنب شرکت بهروز
33878916-031',
                'EN' => 'Esfahan
University Square, Imam Khomeini St., after Shapur Jadid, Shahid Zarrin St., next to Behrooz Company
33878916-031',
                'RU' => 'Исфахан
Университетская площадь, ул. Имама Хомейни, им. Шапура Джадида, ул. Шахида Заррина, рядом с компанией Behrooz
33878916-031',
                'AR' => 'اصفهان
ساحة الجامعة شارع الامام الخميني بعد شابور جديد شارع الشهيد زرين بجوار شركة بهروز
33878916-031',
            ],
            [
                'id' => 3,
                'name' => 'Alborz',
                'FA' => 'کرج
جاده شهریار،شهرک صنعتی سیمین دشت،خیابان هشتم غربی،پلاک 148
36670562-026',
                'EN' => 'Karaj
Shahriar Road, Simin Dasht Industrial Town, West 8th Street, No. 148
36670562-026',
                'RU' => 'Карадж
Shahriar Road, промышленный город Simin Dasht, West 8th Street, No. 148
36670562-026',
                'AR' => 'كرج
طريق شهريار ، المدينة الصناعية سيمين دشت ، غرب شارع 8 ، رقم 148
36670562-026',
            ],
            [
                'id' => 4,
                'name' => 'Ilam',
                'FA' => 'ايلام',
                'EN' => 'Ilam',
                'RU' => 'ايلام',
                'AR' => 'ايلام',
            ],
            [
                'id' => 5,
                'name' => 'East Azarbaijan',
                'FA' => 'تبریز،
                میدان بسیج،جاده 2 تهران، 200متر بالاتر ازجنب کارخانه آناتا
36373465-041',
                'EN' => 'Tabriz,
                Sage Square, 2 Avenue Tahran, 200 meters per square meter, Azjeb Karkhana Anata
041-36373465',
                'RU' => 'Тебриз,
Площадь Басидж, дорога 2, Тегеран, на высоте 200 метров над фабрикой Аната
36373465-041',
                'AR' => 'تبريز ،
ساحة الباسيج ، طريق 2 ، طهران ، 200 متر فوق مصنع عناتا
36373465-041',
            ],
            [
                'id' => 6,
                'name' => 'Western Azerbaijan',
                'FA' => 'ارومیه
جاده سلماس، کوی تالار دلگشا،شرکت بستنی اطمینان
3-32722652-044',
                'EN' => 'Orumieh
Salmas Road, Delgosha Hall Alley, Atminan Ice Cream Company
3-32722652-044',
                'RU' => 'Orumieh
Salmas Road, Delgosha Hall Alley, компания Atminan Ice Cream Company
3-32722652-044',
                'AR' => 'أرومية
طريق سلماس ، زقاق صالة دلغوشا ، شركة أتمينان للآيس كريم
044-32722652-3',
            ],
            [
                'id' => 7,
                'name' => 'Bushehr',
                'FA' => 'بوشهر',
                'EN' => 'Bushehr',
                'RU' => 'Бушер',
                'AR' => 'بوشهر',
            ],
            [
                'id' => 8,
                'name' => 'Tehran',
                'FA' => 'تهران مرکز
کیلومتر11اتوبان فتح،سه راهی شهریار،بعد ازسعیدآباد،قبل از پل بادامک، روبروی پمپ بنزین،خیابان وحید1 ،پلاک 23
65606580-021
--------------------------------------------------
تهران غرب
کیلومتر11اتوبان فتح،سه راهی شهریاربه سمت باغستان ،بعد ازسعیدآباد،قبل از پل بادامک، روبروی پمپ بنزین،خیابان وحید1 ،پلاک 23
65606580-021
--------------------------------------------------
تهران شرق و جنوب
شهرری،جاده قدیم قم- تهران(خیابان رجایی جنوبی)،شهر سنگ،کوچه دوم گل رز،پلاک11
7-55227976-021',
                'EN' => 'Centeral Tehran
11 km of Fatah highway, Shahriyar intersection, after Saeedabad, before Badamak bridge, in front of gas station, Vahid 1 street, No. 23
65606580-021
--------------------------------------------------
West Tehran
11 km of Fatah Highway, Shahriar Towards Baghistan, after Saeed Abad, before Badamak Bridge, in front of gas station, Vahid 1 St., No. 23
65606580-021
--------------------------------------------------
East and south of Tehran
Shahreri, Old Qom-Tehran Road (South Rajai St.), Shahr-e Sang, 2nd Rose Alley, No. 11
7-55227976-021',
                'RU' => 'Центральный Тегеран
11 км шоссе Фатх, перекресток Шахрияр, после Саидабада, перед мостом Бадамак, напротив АЗС, улица Вахид 1, дом 23
65606580-021
--------------------------------------------------
Западный Тегеран
11 км шоссе Фатх, Шахрияр в сторону Багистана, после Саид Абада, перед мостом Бадамак, напротив АЗС, ул. Вахид 1, № 23
65606580-021
--------------------------------------------------
К востоку и югу от Тегерана
Shahreri, Old Qom-Tehran Road (South Rajai St.), Shahr-e Sang, 2nd Rose Alley, No. 11
7-55227976-021',
                'AR' => 'طهران المركزية
11 كم من اوتوستراد فتح تقاطع شهريار بعد سعيد اباد قبل جسر بادماك امام محطة الوقود شارع وحيد 1 رقم 23
65606580-021
--------------------------------------------------
غرب طهران
11 كم من اوتوستراد فتح ، شهريار باتجاه باغستان ، بعد سعيد آباد ، قبل جسر بادماك ، أمام محطة الوقود ، شارع وحيد 1 ، رقم 23
65606580-021
--------------------------------------------------
شرق وجنوب طهران
شهرري ، طريق قم القديمة - طهران (جنوب شارع رجائي) ، شهر سانغ ، زقاق الورد الثاني ، رقم 11
021-55227976-7',

            ],
            [
                'id' => 9,
                'name' => 'Chaharmahal O Bakhtiari',
                'FA' => 'چهار محال و بختیاری',
                'EN' => 'Chaharmahal O Bakhtiari',
                'RU' => 'Чахармахал и Бахтиари',
                'AR' => 'شارمحال وبختياري',

            ],
            [
                'id' => 10,
                'name' => 'South Khorasan',
                'FA' => 'خراسان جنوبي',
                'EN' => 'South Khorasan',
                'RU' => 'خراسان جنوبي',
                'AR' => 'خراسان جنوبي',
            ],
            [
                'id' => 11,
                'name' => 'Khorasan Razavi',
                'FA' => 'مشهد
کیلومتر5 جاده قوچان، مقابل آزادی135، داخل مجموعه شهد ایران
4-36585651-051',
                'EN' => 'Mashhad
5 km of Quchan road, in front of Azadi 135, inside the nectar complex of Iran
4-36585651-051',
                'RU' => 'Мешхед
5 км дороги Кучан, напротив Азади 135, внутри нектарного комплекса Ирана
4-36585651-051',
                'AR' => 'مشهد
5 كم من طريق قوجان ، أمام آزادي 135 ، داخل مجمع الرحيق الإيراني
4-36585651-051',

            ],
            [
                'id' => 12,
                'name' => 'North Khorasan',
                'FA' => 'خراسان شمالي',
                'EN' => 'North Khorasan',
                'RU' => 'Северный Хорасан',
                'AR' => 'شمال خراسان',

            ],
            [
                'id' => 13,
                'name' => 'Khuzestan',
                'FA' => 'خوزستان',
                'EN' => 'Khuzestan',
                'RU' => 'Хузестан',
                'AR' => 'خوزستان',
            ],
            [
                'id' => 14,
                'name' => 'Zanjan',
                'FA' => 'زنجان
شهرک صنعتی علی آباد، خیابان تیر،ابتدای روزبه 9
32222081-024
32222315-024',
                'EN' => 'Zanjan
Aliabad Industrial Town, Tir St., beginning of Roozbeh 9
32222081-024
32222315-024',
                'RU' => 'Зенджан
Промышленный город Алиабад, ул. Тир, начало улицы Рузбех 9
32222081-024
32222315-024',
                'AR' => 'زنجان
مدينة علي آباد الصناعية شارع تير بداية روزبه 9
32222081-024
32222315-024',

            ],
            [
                'id' => 15,
                'name' => 'Semnan',
                'FA' => 'سمنان',
                'EN' => 'Semnan',
                'RU' => 'سمنان',
                'AR' => 'سمنان',
            ],
            [
                'id' => 16,
                'name' => 'Sistan O Baluchestan',
                'FA' => 'زاهدان
شهرک صنعتی جاده میرجاوه، بلوار کارگر، نبش کارگر5
33592447-054',
                'EN' => 'Sistan-o-Baluchestan sales office
Industrial Town - Mirjaveh Road - Kargar Boulevard - Corner of Kargar 5 - The first door on the left
Phone: 33592447 - 054',
                'RU' => 'Офис продаж в Систане и Белуджистане
Промышленный город - улица Мирджаве - бульвар Каргар - угол Каргара 5 - первая дверь слева
Телефон: 33592447 - 054',
                'AR' => 'مكتب مبيعات سيستان وبلوشستان
المدينة الصناعية - طريق الميرجفة - بوليفارد كركر - ناصية كركر 5 - الباب الأول على اليسار
هاتف: 33592447-054',

            ],
            [
                'id' => 17,
                'name' => 'Fars',
                'FA' => 'شیراز
شهرک بزرگ صنعتی ،میدان سوم، خیابان کوشش جنوبی،خیابان207 ،سمت راست،
سوله سوم
37740372-071
37740163-071
37740165-071',
                'EN' => 'Shiraz
Large Industrial Town, Third Square, South Kooshesh St., 207 St., Right, third Niches
37740372-071
37740163-071
37740165-071',
                'RU' => 'Шираз
Большой промышленный городок, Третья площадь, Южный Коошеш ул., 207 ул., Направо,
37740372-071
37740163-071
37740165-071',
                'AR' => 'شيراز
المدينة الصناعية الكبيرة ، الساحة الثالثة ، شارع جنوب كوشيش ، شارع 207 ، يمين ،
سوله سوم
37740372-071
37740163-071
37740165-071',

            ],
            [
                'id' => 18,
                'name' => 'Qazvin',
                'FA' => 'قزوين',
                'EN' => 'Qazvin',
                'RU' => 'قزوين',
                'AR' => 'قزوين',


            ],
            [
                'id' => 19,
                'name' => 'Qom',
                'FA' => 'قم
جاده قدیم قم- تهران،بلوارخدا کرم،روبروی ترمینال،کوچه ششم،جنب مدرسه شهید فهمیده
4-36642861-025',
                'EN' => 'Qom
Old Qom-Tehran road, Khoda Karam Boulevard, in front of the terminal, sixth alley, next to Shahid Fahmideh school
4-36642861-025',
                'RU' => 'Кум
Старая дорога Кум-Тегеран, бульвар Хода Карам, напротив терминала, 6-й переулок, рядом со школой Шахида Фахмиде
4-36642861-025',
                'AR' => 'قم
طريق قم - طهران القديم ، شارع خودة كرم ، أمام الصالة ، الزقاق السادس ، بجانب مدرسة الشهيد فهميدة
025-36642861-4',
            ],
            [
                'id' => 20,
                'name' => 'Kordestan',
                'FA' => 'كردستان',
                'EN' => 'Kordestan',
                'RU' => 'كردستان',
                'AR' => 'كردستان',

            ],
            [
                'id' => 21,
                'name' => 'Kerman',
                'FA' => 'کرمان
انتهای بلوار امیرکبیر، بلوارعطا احمدی
4-32150263-034',
                'EN' => 'Kerman
The end of Amirkabir Boulevard, Ata Ahmadi Boulevard
4-32150263-034',
                'RU' => 'Керман
Конец бульвара Амиркабир, бульвар Ата Ахмади
4-32150263-034',
                'AR' => 'كرمان
نهاية شارع أمير كبير ، شارع عطا الأحمدي
034-32150263-4',

            ],
            [
                'id' => 22,
                'name' => 'Kermanshah',
                'FA' => 'کرمانشاه
شهرک صنعتی فرامان، بلوار امیرکبیر، نبش جهاد 2
34733799-083
34733592-083
34733817-083',
                'EN' => 'Kermanshah
Faraman Industrial Town, Amirkabir Boulevard, corner of Jihad 2
34733799-083
34733592-083
34733817-083',
                'RU' => 'Керманшах
Промышленный городок Фараман, бульвар Амиркабир, угол Джихада 2
34733799-083
34733592-083
34733817-083',
                'AR' => 'كرمانشاه
مدينة فارمان الصناعية ، شارع أمير كبير ، ناصية الجهاد 2
34733799-083
34733592-083
34733817-083',

            ],
            [
                'id' => 23,
                'name' => 'Kohgiluyeh and Boyer-Ahmad',
                'FA' => 'کهگیلویه و بویر احمد',
                'EN' => 'Kohgiluyeh and Boyer-Ahmad',
                'RU' => 'Кохгилуе и Бойер-Ахмад',
                'AR' => 'كوهجيلويه و بوير أحمد',

            ],
            [
                'id' => 24,
                'name' => 'Golestan',
                'FA' => 'گلستان',
                'EN' => 'Golestan',
                'RU' => 'Голестан',
                'AR' => 'جولستان',

            ],
            [
                'id' => 25,
                'name' => 'Gilan',
                'FA' => 'رشت
کیلومتر 8 جاده تهران،جنب تالار گویا،داخل مجتمع گیلان قوت
2-33691051-013
33690219-013',
                'EN' => 'Rasht
8 km of Tehran road, next to Goya Hall, inside Gilan Ghot Complex
2-33691051-013
33690219-013',
                'RU' => 'Рашт
8 км Тегеранской дороги, рядом с Goya Hall, внутри комплекса Gilan Ghot
2-33691051-013
33690219-013',
                'AR' => 'رشت
8 كيلومترات من طريق طهران ، بجوار قاعة جويا ، داخل مجمع جيلان غوت
2-33691051-013
33690219-013',

            ],
            [
                'id' => 26,
                'name' => 'Lorestan',
                'FA' => 'لرستان',
                'EN' => 'Lorestan',
                'RU' => 'لرستان',
                'AR' => 'لرستان',
            ],
            [
                'id' => 27,
                'name' => 'Mazandaran',
                'FA' => 'بابل
کیلومتر4 جاده قائم شهر،300 متر بعد از دانشگاه آزاد،روبروی شرکت درنا
32318870-011',
                'EN' => 'Babol
4 km of Ghaemshahr road, 300 meters after Azad University, in front of Derna company
32318870-011',
                'RU' => 'Вавилон
4 км дороги Гамшахр, в 300 метрах от университета Азад, напротив компании Дерна
32318870-011',
                'AR' => 'بابل
4 كم من طريق غيمشهر ، 300 متر بعد جامعة آزاد ، أمام شركة درنة
32318870-011',
            ],
            [
                'id' => 28,
                'name' => 'Markazi',
                'FA' => 'مركزي',
                'EN' => 'Markazi',
                'RU' => 'مركزي',
                'AR' => 'مركزي',
            ],
            [
                'id' => 29,
                'name' => 'Hormozgan',
                'FA' => 'بندرعباس
چهچکور،کیلومتر 5 جاده سیرجان،جنب گروه صنعتی نجاتی (آناتا)
32568027-076',
                'EN' => 'Bandar Abbas
Chechkour, 5 km of Sirjan road, next to Nejat Industrial Group (Anata)
32568027-076',
                'RU' => 'Бандар Аббас
Чечкур, 5 км дороги Сирджан, рядом с промышленной группой Неджат (Аната)
32568027-076',
                'AR' => 'بندر عباس
شقور ، 5 كلم من طريق سيرجان ، بجانب نجاة المجموعة الصناعية (عناتا)
32568027-076',
            ],
            [
                'id' => 30,
                'name' => 'Hamedan',
                'FA' => 'همدان
جاده کرمانشاه،200متر جلوتر از پلیس راه قدیم بهار،جنب تالار لاله الوند
34586907-081',
                'EN' => 'Hamedan
Kermanshah road, 200 meters in front of the old spring road police, next to Laleh Alvand Hall
34586907-081',
                'RU' => 'Хамедан
Керманшах-роуд, в 200 метрах от старой весенней дорожной полиции, рядом с Laleh Alvand Hall
34586907-081',
                'AR' => 'همدان
طريق كرمانشاه 200 متر امام شرطة طريق الربيع القديم بجوار صالة لاله الفاند
34586907-081',
            ],
            [
                'id' => 31,
                'name' => 'Yazd',
                'FA' => 'يزد',
                'EN' => 'Yazd',
                'RU' => 'Йезд',
                'AR' => 'يزد',
            ],

        ];
        foreach ($States as $State) {

            DB::table('sales_offices')->insert([
                'id' => $State['id'],
            ]);
            foreach (SiteLang() as $locale => $specs) {
                DB::table('locale_contents')->insert([
                    'page' => 'sales_office',
                    'section' => 'sales_office',
                    'element_id' => $State['id'],
                    'locale' => $locale,
                    'element_title' => $State['name'],
                    'element_content' => $State[$locale],

                ]);
            }
        }
    }
}